# Лабораторная работа №6
## Задание
1. Напишите программу для решения задач своего варианта.
2. Оформите отчёт в README.md. Отчёт должен содержать:
    - Условия задач
    - Описание проделанной работы
    - Скриншоты результатов
    - Ссылки на используемые материалы
### 1. Напишите программу 1 вариант
#### 1.1
Тимофей составляет 5-буквенные коды из букв Т, И, М, О, Ф, Е, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой И. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Тимофей?

```python
from itertools import permutations

letters = ['Т', 'И', 'М', 'О', 'Ф', 'Е', 'Й']
code = set()

for p in permutations(letters, 5):
    if p[0] != 'Й' and p[-1] != 'Й' and 'ИЙ' and 'ЙИ' not in ''.join(p):
        code.add(''.join(p))

print(len(codes))
```
#### 1.2
Сколько единиц содержится в двоичной записи значения выражения $4 ^ {2020} + 2 ^ {2017} − 15?$ 
```python
result = 4 ** 2020 + 2 ** 2017 - 15
binar = bin(result)[2:]
count_one = binar.count('1')
print(count_one)
```
#### 1.3
Найдите среди целых чисел, принадлежащих числовому отрезку $[174457; 174505]$, числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания. 
```python
def find_delit(num):
    delit = []
    for i in range(2, int(num*0.5)):
        if num % i == 0:
            delit.append((i, num//i))
    return delit


for num in range(174457, 174506):
    delit = find_delit(num)
    if len(delit) == 2:
        delit1, delit2 = delit[0]
        print(delit1, delit2)


```
### 2. Оформите отчёт в README.md.
Да
