# Лабораторная работа №6
## Задание
1. Напишите программу для решения задач своего варианта.
2. Оформите отчёт в README.md. Отчёт должен содержать:
    - Условия задач
    - Описание проделанной работы
    - Скриншоты результатов
    - Ссылки на используемые материалы
## Ход работы 
### 1. Напишите программу для решения задач своего варианта. (Вариант 1)
#### Задача 1
Тимофей составляет 5-буквенные коды из букв Т, И, М, О, Ф, Е, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой И. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Тимофей?

```python
from itertools import permutations

letters = ['Т', 'И', 'М', 'О', 'Ф', 'Е', 'Й']
codes = set()

for p in permutations(letters, 5):
    if p[0] != 'Й' and p[-1] != 'Й' and 'ИЙ' and 'ЙИ' not in ''.join(p):
        codes.add(''.join(p))

print(len(codes))
```
#### Задача 2
Сколько единиц содержится в двоичной записи значения выражения $4 ^ {2020} + 2 ^ {2017} − 15?$ 
```python
result = 4 ** 2020 + 2 ** 2017 - 15
binar = bin(result)[2:]
count_ones = binar.count('1')
print(count_ones)
```
#### Задача 3
Найдите среди целых чисел, принадлежащих числовому отрезку $[174457; 174505]$, числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания. 
```python
def find_divisors(num):
    divisors = []
    for i in range(2, int(num**0.5) + 1):
        if num % i == 0:
            divisors.append((i, num//i))
    return divisors


for num in range(174457, 174506):
    divisors = find_divisors(num)
    if len(divisors) == 1:
        divisor1, divisor2 = divisors[0]
        print(divisor1, divisor2)


```
### 2. Оформите отчёт в README.md.
Это и есть отчёт md)
